In [7]:
import pandas as pd
import sqlalchemy as db
from sqlalchemy import text

In [8]:
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/res_province_transact_db")
conn = engine.connect()

In [9]:
query = """
SELECT st.id, pr.country_id, pr.name AS pais, st.name AS direccion FROM res_province AS pr
INNER JOIN street AS st ON pr.id = st.res_province_id
"""

In [10]:
street_data = pd.read_sql(query, conn)
# print(street_data)
street_data["id"] = street_data["id"].astype('int')
street_data

   id  country_id          pais                 direccion
0   1          62        La Paz         Avenida Argentina
1   2          62        La Paz               Calle Colon
2   3          62    Santa Cruz  Avenida MonseÃ±or Rivero
3   4          62    Santa Cruz            Calle La Salle
4   5          19  Buenos Aires     Avenida Las AmÃ©ricas
5   6          19  Buenos Aires          Calle Cochabamba

In [12]:
res_country=pd.read_csv("./data/res_country.csv")
res_country['currency_id'] = res_country['currency_id'].astype('int')
res_country.rename(columns={'name': 'pais', 'currency_id' : 'country_id'}, inplace=True)
res_country

    country_id  phone_code code                               pais
0           47          93   AF                        Afghanistan
1          118         355   AL                            Albania
2          111         213   DZ                            Algeria
3            1        1684   AS                     American Samoa
4          125         376   AD                            Andorra
..         ...         ...  ...                                ...
95          84         509   HT                              Haiti
96          21         672   HM  Heard Island and McDonald Islands
97         125         379   VA      Holy See (Vatican City State)
98          44         504   HN                           Honduras
99          24         852   HK                          Hong Kong

[100 rows x 4 columns]

In [14]:
street_data = pd.merge(res_country, street_data, left_on='country_id', right_on='country_id')
street_data

,country_id,phone_code,code,pais_x,id,pais_y,direccion
0,19,54,AR,Argentina,5,Buenos Aires,Avenida Las AmÃ©ricas
1,19,54,AR,Argentina,6,Buenos Aires,Calle Cochabamba
2,62,591,BO,Bolivia,1,La Paz,Avenida Argentina
3,62,591,BO,Bolivia,2,La Paz,Calle Colon
4,62,591,BO,Bolivia,3,Santa Cruz,Avenida MonseÃ±or Rivero
5,62,591,BO,Bolivia,4,Santa Cruz,Calle La Salle